# Найти сумму и произведение цифр трехзначного числа, которое вводит пользователь.
# https://drive.google.com/file/d/1pQ-FAfXQy3MeIcjPZ9ORQS528H6fdpSa/view?usp=sharing
a = input("Введите число: ")
b, c, d = a[0], a[1], a[2]
print(f'Произведение чисел: {int(b)*int(c)*int(d)}')
print(f'Сумма чисел: {int(b)+int(c)+int(d)}')

